app/Http/Livewire/Admin/Appointments/ListAppointments.php

	public function getAppointmentsProperty()
	{
		return Appointment::with('client')
    		->when($this->status, function ($query, $status) {
    			return $query->where('status', $status);
    		})
    		->latest()
    		->paginate(3);
---
select * from `clients` where `clients`.`id` in (1)
select count(*) as aggregate from `appointments`

    public function render()
    {
    	$appointments = $this->appointments;

    	$appointmentsCount = Appointment::count();
    	$scheduledAppointmentsCount = Appointment::where('status', 'scheduled')->count();
    	$closedAppointmentsCount = Appointment::where('status', 'closed')->count();
---
select count(*) as aggregate from `appointments` where `status` = 'scheduled'