app/Http/Livewire/Admin/Dashboard/UsersCount.php

select count(*) as aggregate from `users` where `created_at` between '2021-07-09 00:00:00' and '2021-07-09 04:00:03'
---
    public function getUsersCount($option = 'TODAY')
    {
        $this->usersCount = User::query()
            ->whereBetween('created_at', $this->getDateRange($option))
            ->count();