app/Http/Livewire/Admin/Users/ListUsers.php

select * from `users` where `name` like '%%' or `email` like '%%' order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `users` where `name` like '%%' or `email` like '%%'
---
    public function render()
    {
    	$users = User::query()
    		->where('name', 'like', '%'.$this->searchTerm.'%')
    		->orWhere('email', 'like', '%'.$this->searchTerm.'%')
    		->latest()->paginate(5);