app/Http/Livewire/Admin/Settings/UpdateSetting.php

update `settings` set `site_name` = 'Multipurpose Laravel & Livewire', `site_title` = 'Clovon', `settings`.`updated_at` = '2021-07-09 20:25:27' where `id` = 3
---
    public function updateSetting()
    {
        $setting = Setting::first();

        if ($setting) {
            $setting->update($this->state);